app/controllers/users_controller.rb

    def create

    	user = User.new(params[:user])
    	if user.save
---
INSERT INTO "users" ("age", "created_at", "phone", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["age", 0], ["created_at", Thu, 06 Oct 2016 18:55:25 UTC +00:00], ["phone", "dfgdfgd"], ["updated_at", Thu, 06 Oct 2016 18:55:25 UTC +00:00], ["username", "rohit"]]

    def edit
    	##binding.pry
    	@user = User.where(id:params[:id]).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

  	def update
  		@user= User.where(id:params[:id]).first
  		@user.username=params[:user][:username]
  		@user.age= params[:user][:age]
  		@user.phone=params[:user][:phone]
  		if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
UPDATE "users" SET "username" = 'user3`', "age" = 99, "phone" = 'ojojj''o', "updated_at" = '2016-10-12 21:24:54.900697' WHERE "users"."id" = 3